Repository: evennia/evennia
Catalog: evennia/locale/*/LC_MESSAGES/django.po
Languages: de, fr, pt

source: |c{key}|R is already puppeted by another Account.
de: |c{key}|R wird schon von einem anderen Account gesteuert.
pt: |c{key}|R já está a ser conrolado por outra conta.

source: You cannot control any more puppets (max {_MAX_NR_SIMULTANEOUS_PUPPETS})
pt: Não pode controlar mais nenhum fantoche (max {_MAX_NR_SIMULTANEOUS_PUPPETS})

source: Too many login failures; please try again in a few minutes.
de: Zu viele fehlgeschlagene Loginversuche. Bitte versuche es in ein paar Minuten erneut.
pt: Demasiadas falhas de autenticação; por favor volta a tentar dentro de alguns minutos.

source: |rYou have been banned and cannot continue from here. If you feel this ban is in error, please email an admin.|x
de: |rDu wurdest gebannt und kannst hier nicht weiter. Wenn du der Meinung bist, dass diese Sperre zu Unrecht erfolgt ist, sende bitte eine E-Mail an einen Administrator.|x
pt: |rVocê foi banido e não pode passar daqui. Se acredita que este banimento foi um erro, por favor contacte um admin por email.|x

source: Username and/or password is incorrect.
de: Benutzername und/oder Passwort ist falsch.
pt: Username e/ou password incorrectos.

source: Too many authentication failures.
de: Zu viele fehlgeschlagene Authentifizierungen.
pt: Demasiadas falhas de autenticação.

source: You are creating too many accounts. Please log into an existing account.
de: Sie erstellen zu viele Konten. Bitte melden Sie sich bei einem bestehenden Konto an.
pt: Está a criar demasiadas contas. Por favor ligue-se a uma conta existente.

source: There was an error creating the Account. If this problem persists, contact an admin.
de: Beim Erstellen des Kontos ist ein Fehler aufgetreten. Wenn dieses Problem weiterhin besteht, wenden Sie sich an einen Administrator.
pt: Ocorreu um erro ao criar a conta. Se este problema persistir, contacte um admin.

source: An error occurred. Please e-mail an admin if the problem persists.
de: Es ist ein Fehler aufgetreten. Bitte senden Sie eine E-Mail an einen Administrator, wenn das Problem weiterhin besteht.
pt: Ocorreu um erro. Por favor contacte um admin por e-mail caso o problema persista.

source: |G{key} connected|n
de: |G{key} verbunden|n
pt: |G{key} ligado|n

source: |R{key} disconnected{reason}|n
de: |R{key} getrennt {reason}|n
pt: |R{key} desligado{reason}|n

source: Guest accounts are not enabled on this server.
de: Gastkonten sind auf diesem Server nicht aktiviert.
pt: Contas guest não estão activadas neste servidor.

source: All guest accounts are in use. Please try again later.
de: Alle Gastaccounts sind bereits in Benutzung. Bitte versuche es später nochmal.
pt: Todas as contas guest estão em utilização. Por favor tente mais tarde.

source: An untrapped error occurred.
de: Ein nicht abgefangener Fehler ist aufgetreten
pt: Um erro não previsto ocorreu.

source: An untrapped error occurred. Please file a bug report detailing the steps to reproduce.
de: Ein nicht abgefangener Fehler ist aufgetreten. Bitte reiche einen Fehlerbericht mit detaillierten Schritten zur Reproduktion ein.
pt: Um erro não previsto ocorreu. Por favor reporte o problema detalhando os passos para o reproduzir.

source: A cmdset merger-error occurred. This is often due to a syntax error in one of the cmdsets to merge.
de: Ein 'cmdset merger-error' ist aufgetreten. Dies liegt häufig an einem Syntaxfehler in einem der zusammenzuführenden Cmdsets.
pt: Um cmdset merger-error ocorreu. Isto é tipicamente devido a um erro de sintaxe num dos cmdsets a fazer merge.

source: A cmdset merger-error occurred. Please file a bug report detailing the steps to reproduce.
de: Ein 'cmdset merger-error' ist aufgetreten. Bitte reiche einen Fehlerbericht mit den erforderlichen Schritten zur Reproduktion ein.
pt: Um cmdset merger-error ocorreu. Por favor reporte o problema detalhando os passos para o reproduzir.

source: No command sets found! This is a critical bug that can have multiple causes.
de: Keine 'command sets' gefunden! Dies ist ein kritischer Fehler, der mehrere Ursachen haben kann.
pt: Nenhum conjunto de comandos foi encontrado! Este é um problema crítico que pode ter múltiplas causas.

source: No command sets found! This is a sign of a critical bug. If disconnecting/reconnecting doesn't" solve the problem, try to contact the server admin through" some other means for assistance.
de: Keine 'command sets' gefunden! Dies deutet auf einen kritischen Fehler hin. Falls das Trennen und erneute Verbinden das Problem nicht löst, versuche den Serveradministrator auf anderem Wege zu kontaktieren.
pt: Nenhum conjunto de comandos foi contrado! Ese é um sinal de um problema crítico. Se desligar e voltar a ligar não resolve o problema, tente contactar o admin do servidor através de outros meios para assistência.

source: A command handler bug occurred. If this is not due to a local change, please file a bug report with the Evennia project, including the traceback and steps to reproduce.
de: Ein Fehler im 'command handler' ist aufgetreten. Falls dies nicht auf eine lokale Änderung zurückzuführen ist, sende bitte einen Fehlerbericht an das Evennia-Projekt. Gib dabei den Traceback und die Schritte zur Reproduktion an.
pt: Um problema aconteceu a lidar com um comando. Se isto não foi causado por uma alteração local, por favor reporte um problema com no projecto Evennia, incluindo o traceback e os passos de reprodução.

source: A command handler bug occurred. Please notify staff - they should likely file a bug report with the Evennia project.
de: Ein Fehler im 'command handler' ist aufgetreten. Bitte benachrichtigen Sie die Mitarbeiter – sie sollten wahrscheinlich einen Fehlerbericht an das Evennia-Projekt senden.
pt: Um problema aconteceu a lidar com um comando. Por favor notifique o staff - eles provavelmente deverão reportar um problema no projecto Evennia.

source: Command recursion limit ({recursion_limit}) reached for '{raw_cmdname}' ({cmdclass}).
de: Befehlsrekursionslimit ({recursion_limit}) für '{raw_cmdname}' ({cmdclass}) erreicht.
pt: Limite de recursividade de comandos ({recursion_limit}) atinhido para '{raw_cmdname}' ({cmdclass}).

source: {traceback} {errmsg} (Traceback was logged {timestamp}).
de: {traceback} {errmsg} (Traceback wurde protokolliert {timestamp})
pt: {traceback} {errmsg} (Traceback foi registado em {timestamp}).

source: There were multiple matches.
de: Es gab mehrere Treffer.
fr: Il y a plusieurs correspondances possibles.
pt: Havia várias correspondências.

source: or
de: oder
fr: ou
pt: ou

source: Type "help" for help.
de: Gib "help" für Hilfe ein.
fr: Tapez "help" pour obtenir de l'aide.
pt: Digite "help" para obter ajuda.

source: {traceback} Error loading cmdset '{path}' (Traceback was logged {timestamp})
de: {traceback} Fehler beim Laden von cmdset '{path}' (Traceback wurde protokolliert {timestamp})
fr: {traceback} Une erreur s'est produite lors du chargement du cmdset '{path}' (Référence de l'erreur : {timestamp})
pt: {traceback} Erro ao carregar o cmdset '{path}' (Traceback foi registado em {timestamp})

source: Error encountered for cmdset at path '{path}'. Replacing with fallback '{fallback_path}'.
de: Fehler im cmdset bei Pfad '{path}'. Ersetze mit Ersatzpfad '{fallback_path}'.
fr: Une erreur a été rencontrée lors du chargement du cmdset '{path}'. Le cmdset '{fallback_path}' est utilisé en remplacement.
pt: Erro encontrado para o cmdset na path '{path}'. Substituindo com o fallback '{fallback_path}'.

source: Fallback path '{fallback_path}' failed to generate a cmdset.
de: Ersatzpfad '{fallback_path}' konnte kein cmdset generieren.
fr: Impossible de générer le cmdset de remplacement : '{fallback_path}'.
pt: Path de fallback '{fallback_path}' falhou a gerar um cmdset.

source: custom {mergetype} on cmdset '{cmdset}'
de: Selbsterstellter {mergetype} in cmdset '{cmdset}'
fr: custom {mergetype} sur cmdset '{cmdset}'
pt: {mergetype} personalizado sobre cmdset '{cmdset}'

source: Only CmdSets can be added to the cmdsethandler!
de: Es können nur CmdSets zum cmdsethandler hinzugefügt werden!
fr: Seuls des CmdSets peuvent être ajoutés au cmdsethandler !
pt: Somente CmdSets podem ser adicionados ao cmdsethandler!

source: The destination doesn't exist.
de: Das Ziel existiert nicht.
fr: La destination est inconnue.
pt: O destino não existe.

source: Something went wrong! You are dumped into nowhere. Contact an admin.
de: Etwas ist schief gelaufen! Du bist im Nirgendwo gelandet. Wende dich an einen Administrator.
fr: Quelque chose a mal tourné ! Vous vous trouvez au milieu de nulle part. Veuillez contacter un administrateur.
pt: Algo deu errado! Você foi despejado em lugar nenhum. Contacte um administrador.

source: You now have {name} in your possession.
de: Du hast nun {name} in deinem Besitz.
pt: Você tem agora {name} na sua posse.

source: {object} arrives to {destination} from {origin}.
de: {object} kommt aus {origin} in {destination} an.
pt: {object} chega a {destination} de {origin}.

source: {object} arrives to {destination}.
de: {object} kommt in {destination} an.
pt: {object} chega a {destination}.

source: Invalid character name.
pt: Nome de personagem inválido.

source: There are too many characters associated with this account.
pt: Existem demasiadas personagens associadas a esta conta.

source: |r{obj} has no location and no home is set.|n
de: |r{obj} hat keinen Standort und es ist kein Zuhause gesetzt.|n
pt: |r{obj} não tem localização e nenhuma home está configurada.|n

source: You become |c{name}|n.
de: Du wirst zu |c{name}|n.
pt: Tornas-te |c{name}|n.

source: {name} has entered the game.
de: {name} hat das Spiel betreten.
pt: {name} entrou no jogo.

source: {name} has left the game.
pt: {name} saiu do jogo.

source: You cannot go there.
de: Du kannst da nicht hingehen.
pt: Não pode ir para aí.

source: Error
de: Fehler
pt: Erro

source: Warning
de: Warnung
pt: Aviso

source: Prototype requires a prototype_key
de: Prototype erfordert einen prototype_key
pt: Protótipo precis ade uma prototype_key

source: {protkey} is a read-only prototype (defined as code in {module}).
de: {protkey} ist ein schreibgeschützter Prototyp (definiert als Code in {module}).
pt: {protkey} é um protótipo apenas de leitura (definido como código em {module}).

source: {protkey} is a read-only prototype (passed directly as a dict).
de: {protkey} ist ein schreibgeschützter Prototyp (direkt als dict übergeben)
pt: {protkey} é um protótipo apenas de leitura (passado directamene como um dict).

source: Prototype {prototype_key} was not found.
de: Prototyp {prototype_key} wurde nicht gefunden.
pt: Protótipo {prototype_key} não encontrado.

source: {caller} needs explicit 'edit' permissions to delete prototype {prototype_key}.
de: {caller} benötigt explizite 'edit'-Berechtigungen, um den Prototyp {prototype_key} zu löschen.
pt: {caller} precisa permissões explícitas de edição para apagar o protótipo {prototype_key}.

source: Found {num} matching prototypes among {module_prototypes}.
pt: Encontrados {num} protótipos correspondentes entre {module_prototypes}.

source: No prototypes found.
de: Keine Prototypen gefunden.
pt: Não foram encontrados protótipos.

source: Prototype lacks a 'prototype_key'.
de: Dem Prototyp fehlt ein 'prototype_key'.
pt: Falta ao protótipo uma 'prototype_key'.

source: Prototype {protkey} requires `typeclass` or 'prototype_parent'.
de: Prototyp {protkey} erfordert eine `typeclass` oder ein 'prototype_parent'.
pt: Protótipo {protkey} precisa de `typeclass` ou 'prototype_parent'.

source: Prototype {protkey} can only be used as a mixin since it lacks 'typeclass' or 'prototype_parent' keys.
de: Prototyp {protkey} kann nur als Mixin verwendet werden, da er keine 'typeclass' oder 'prototype_parent' hat.
pt: Protótipo {protkey} pode apenas ser usado como mixin visto que não tem chaves 'typeclass' ou 'prototype_parent'.

source: {err}: Prototype {protkey} is based on typeclass {typeclass}, which could not be imported!
de: {err}: Prototyp {protkey} basiert auf typeclass {typeclass}, die nicht importiert werden konnte!
pt: {err}: Protótipo {protkey} é baseado no typeclass {typeclass}, que não foi possível importar!

source: Prototype {protkey} tries to parent itself.
de: Prototyp {protkey} versucht von sich selbst zu erben.
pt: Protótipo {protkey} tenta ser o seu próprio pai.

source: Prototype {protkey}'s `prototype_parent` (named '{parent}') was not found.
de: Der `prototype_parent` (namens '{parent}') des Prototyps {protkey} wurde nicht gefunden.
pt: O `prototype_parent` (chamado '{parent}') do protótipo {protkey} não foi encontrado.

source: {protkey} has infinite nesting of prototypes.
de: {protkey} hat unendlich Verschachtelte Prototypen.
pt: {protkey} tem um nesting infinito de protótipos.

source: Prototype {protkey} has no `typeclass` defined anywhere in its parent chain. Add `typeclass`, or a `prototype_parent` pointing to a prototype with a typeclass.
de: Für den Prototyp {protkey} ist in seinen übergeordneten Elementen keine `typeclass` definiert. Füge eine `typeclass` oder einen `prototype_parent` hinzu, der auf einen Prototyp mit einer Typklasse verweist.
pt: Protótipo {protkey} não teu um `typeclass` definido em lado algum na sua cadeia de parentagem. Adicione `typeclass`, ou um `prototype_parent` a apontar para um protótipo com um typeclass.

source: Diff contains non-dicts that are not on the form (old, new, action_to_take): {diffpart}
de: Diff enthält non-dicts, die nicht in der Form (old, new, action_to_take) sind: {diffpart}
pt: Diff contém não-dicts que não estão na forma (velho, novo, acção_a_tomar): {diffpart}

source: This is User #1.
de: Dies ist Benutzer #1.
fr: C'est l'utilisateur #1.
pt: Este é o Usuário #1.

source: {servername} DoS protection is active.You are queued to connect in {num} seconds ...
de: {servername}-DoS-Schutz ist aktiv. Du stehst in der Warteschlange, um in {num} Sekunden eine Verbindung herzustellen ...
pt: {servername} Protecção DoS está activa. Está na fila para se ligar em {num} segundos ...

source: Your client sent an incorrect UTF-8 sequence.
de: Ihr Client hat eine falsche UTF-8-Sequenz gesendet.
pt: O seu cliente enviou uma sequência UTF-8 incorrecta.

source: ... Server restarted.
de: … Server wurde neu gestartet.
fr: ... Serveur redémarré.
pt: ... Servidor reiniciado.

source: Logged in from elsewhere. Disconnecting.
de: Von woanders eingeloggt. Verbindung getrennt.
fr: Connexion d'une autre session. Déconnexion de celle-ci.
pt: Logado de outro lugar. Desconectando.

source: Idle timeout exceeded, disconnecting.
de: Idle-Timeout überschritten, Verbindung wird getrennt.
fr: Délai d'inactivité dépassé, déconnexion.
pt: Tempo de inatividade esgotado, desconectando.

source: Too many failed attempts; you must wait a few minutes before trying again.
de: Zu viele Fehlversuche. Du musst einige Minuten warten, bevor du es erneut versuchen kannst.
pt: Demasiadas tentativas falhadas; tem de aguardar alguns minutos antes de tentar outra vez.

source: Sorry, that username is reserved.
de: Dieser Benutzername ist reserviert.
pt: Desculpe, esse username está reservado.

source: Sorry, that username is already taken.
de: Dieser Benutzername ist bereits vergeben.
pt: Desculpe, esse username já está tomado.

source: {policy} From a terminal client, you can also use a phrase of multiple words if you enclose the password in double quotes.
pt: {policy} A partir de um cliente terminal, pode também usar uma frase de múltimas palavras se envolver a password em aspas duplas.

source: <txt> - any non-command is appended to the end of the buffer. : <l> - view buffer or only line(s) <l> :: <l> - raw-view buffer or only line(s) <l> ::: - escape - enter ':' as the only character on the line. :h - this help. :w - save the buffer (don't quit) :wq - save buffer and quit :q - quit (will be asked to save if buffer was changed) :q! - quit without saving, no questions asked :u - (undo) step backwards in undo history :uu - (redo) step forward in undo history :UU - reset all changes back to initial state :dd <l> - delete last line or line(s) <l> :dw <l> <w> - delete word or regex <w> in entire buffer or on line <l> :DD - clear entire buffer :y <l> - yank (copy) line(s) <l> to the copy buffer :x <l> - cut line(s) <l> and store it in the copy buffer :p <l> - put (paste) previously copied line(s) directly after <l> :i <l> <txt> - insert new text <txt> at line <l>. Old line will move down :r <l> <txt> - replace line <l> with text <txt> :I <l> <txt> - insert text at the beginning of line <l> :A <l> <txt> - append text after the end of line <l> :s <l> <w> <txt> - search/replace word or regex <w> in buffer or on line <l> :j <l> <w> - justify buffer or line <l>. <w> is f, c, l or r. Default f (full) :f <l> - flood-fill entire buffer or line <l>: Equivalent to :j left :fi <l> - indent entire buffer or line <l> :fd <l> - de-indent entire buffer or line <l> :echo - turn echoing of the input on/off (helpful for some clients)
pt: <txt> - qualquer não-comando é anexado ao fim do buffer. : <l> - ver buffer ou apenas a(s) linha(s) <l> :: <l> - ver em raw o buffer ou apenas a(s) linha(s) <l> ::: - escape - introduz ':' como o único caracter na linha. :h - esta ajuda. :w - grava o buffer (não sai) :wq - grava o buffer e sai :q - sair (pergunta se é preciso gravar, se o buffer foi alterado) :q! - sair sem gravar, sem perguntas feitas :u - (undo) passo atrás no histórico de edições :uu - (redo) passo à frente no histórico de edições :UU - limpa todas as alterações e regressa ao estado inicial :dd <l> - apaga a(s) última(s) linha(s) <l> :dw <l> <w> - apaga a palavra ou expressão regular <w> em todo o buffer ou na linha <l> :DD - apaga todo o buffer :y <l> - copia a(s) <l> linha(s) para o buffer de cópia :x <l> - corta a(s) <l> linha(s) e guarda-as no buffer de cópia :p <l> - cola as linhas anteriormente copiadas directamente após <l> :i <l> <txt> - insere o novo texto <txt> na linha <l>. A linha antiga irá mover-se para baixo :r <l> <txt> - substitui a linha <l> com o texto <txt> :I <l> <txt> - insere texto no início da linha <l> :A <l> <txt> - adiciona text no final da linha <l> :s <l> <w> <txt> - encontra/substitui a palavra ou expressão regular <w> no buffer ou na linha <l> :j <l> <w> - justifica buffer ou linha <l>. <w> é f, c, l ou r. Por omissão é f (full/cheio) :f <l> - inunda-preenche todo o buffer ou a linha <l>: Equivalente a fazer :j left :fi <l> - indenta todo o buffer ou a linha <l> :fd <l> - desindenta todo o buffer ou a linha <l> :echo - liga ou desliga o echo do input (útil para alguns clientes)

source: Legend: <l> - line number, like '5' or range, like '3:7'. <w> - a single word, or multiple words with quotes around them. <txt> - longer string, usually not needing quotes.
pt: Legenda: <l> - número da linha, como '5' ou série, como '3:7'. <w> - palavra única, ou várias palavras envoltas por aspas. <txt> - string mais longa, tipicamente sem necessidade de aspas.

source: :! - Execute code buffer without saving :< - Decrease the level of automatic indentation for the next lines :> - Increase the level of automatic indentation for the next lines := - Switch automatic indentation on/off
pt: :! - Executa o buffer de código sem gravar :< - Diminui o nível da indentação automática para as próximas linhas :> - Aumenta o nível da indentação automática para as próximas linhas := - Liga ou desliga a indentação automática

source: {error} |rBuffer load function error. Could not load initial data.|n
pt: {error} |rErro no carregamento da função no buffer. Não foi possível carregar os dados iniciais.|n

source: {error} |rSave function returned an error. Buffer not saved.|n
pt: {error} |rFunção de gravação devolveu um erro. O buffer não foi gravado.|n

source: |rNo save function defined. Buffer cannot be saved.|n
pt: |rNão há função de gravação definida. O buffer não pode ser gravado.|n

source: No changes need saving
pt: Não há alterações a gravar

source: Exited editor.
pt: Editor encerrado.

source: {error} |rQuit function gave an error. Skipping.|n
pt: {error} |rFunção de saída de erro. Saltando.|n

source: {error} |rThe editor state could not be saved for persistent mode. Switching to non-persistent mode (which means the editor session won't survive an eventual server reload - so save often!)|n
pt: {error} |rO estado do editor não pode ser gravado para modo persistente. Mudando para o modo não-persistente (o que significa que a sessão do editor não irá sobreviver um eventual reload do servidor - por isso grava frequentemente!)|n

source: EvEditor persistent-mode error. Commonly, this is because one or more of the EvEditor callbacks could not be pickled, for example because it's a class method or is defined inside another function.
pt: Erro no modo persistente do EvEditor. Tipicamente, isto é porque um ou mais dos callbacks do EvEditor não puderam ser pickled, por exemplo porque é um método de classe ou é definido dentro de outra função.

source: Nothing to undo.
pt: Nada a desfazer.

source: Nothing to redo.
pt: Nada a refazer.

source: Undid one step.
pt: Desfeito um passo.

source: Redid one step.
pt: Refeito um passo.

source: Single ':' added to buffer.
pt: Um único ':' foi adicionado ao buffer.

source: Save before quitting?
pt: Gravar antes de sair?

source: Reverted all changes to the buffer back to original state.
pt: Revertidas todas as alterações ao buffer para o estado original.

source: Deleted {string}.
pt: {string} apagado.

source: You must give a search word to delete.
pt: Deve indicar uma palavra a apagar.

source: Removed {arg1} for lines {l1}-{l2}.
pt: Removido {arg1} para as linhas {l1}-{l2}.

source: Removed {arg1} for {line}.
pt: Removido {arg1} para {line}.

source: Cleared {nlines} lines from buffer.
pt: Limpas {nlines} linhas do buffer.

source: {line}, {cbuf} yanked.
pt: {line}, {cbuf} copiados.

source: {line}, {cbuf} cut.
pt: {line}, {cbuf} cortados.

source: Copy buffer is empty.
pt: O buffer de cópia está vazio.

source: Pasted buffer {cbuf} to {line}.
pt: Buffer {cbuf} colado a {line}.

source: You need to enter a new line and where to insert it.
pt: Tem de adicionar uma nova linha e onde a inserir.

source: Inserted {num} new line(s) at {line}.
pt: Inserida(s) {num} nova(s) linha(s) em {line}.

source: You need to enter a replacement string.
pt: Precisa de inserir uma string de substituição.

source: Replaced {num} line(s) at {line}.
pt: Substituídas {num} linhas em {line}.

source: You need to enter text to insert.
pt: Tem de indicar o texto a inserir.

source: Inserted text at beginning of {line}.
pt: Inserido texto no início de {line}.

source: You need to enter text to append.
pt: Tem de indicar o texto a adicionar.

source: Appended text to end of {line}.
pt: Texto adicionar ao fim de {line}.

source: You must give a search word and something to replace it with.
pt: Tem de indicar uma palavra de pesquisa e algo com a qual a substituir.

source: Search-replaced {arg1} -> {arg2} for lines {l1}-{l2}.
pt: Procurado e substituído {arg1} -> {arg2} para as linhas {l1}-{l2}.

source: Search-replaced {arg1} -> {arg2} for {line}.
pt: Procurado e substituído {arg1} -> {arg2} para a linha {line}.

source: Flood filled lines {l1}-{l2}.
pt: Linhas {l1}-{l2} inundadas-preenchidas.

source: Flood filled {line}.
pt: {line} inundada-preenchida.

source: Valid justifications are
pt: Justificações válidas são

source: {align}-justified lines {l1}-{l2}.
pt: Linhas {l1}-{l2} justificadas em {align}.

source: {align}-justified {line}.
pt: {line} justificada em {align}.

source: Indented lines {l1}-{l2}.
pt: Linhas {l1}-{l2} indentadas.

source: Indented {line}.
pt: {line} indentada.

source: Removed left margin (dedented) lines {l1}-{l2}.
pt: Removida a margem esquerda (desindentação) às linhas {l1}-{l2}.

source: Removed left margin (dedented) {line}.
pt: Removida a margem esquerda (desindentação) à {line}.
