Repository: evennia/evennia
Catalog: evennia/locale/*/LC_MESSAGES/django.po
Languages: de, fr, pt

source: Echo mode set to {mode}
pt: Modo de echo alterado para {mode}

source: This command is only available in code editor mode.
pt: Este comando só está disponível no modo de editor de código.

source: Decreased indentation: new indentation is {indent}.
pt: Indentação diminuiada: a nova indentação é {indent}.

source: |rManual indentation is OFF.|n Use := to turn it on.
pt: |rIndentação manual está desligada.|n Use := para a ligar.

source: Increased indentation: new indentation is {indent}.
pt: Indentação aumentada: a nova indentação é {indent}.

source: Auto-indentation turned on.
pt: Auto-indentação ligada.

source: Auto-indentation turned off.
pt: Auto-indentação desligada.

source: Line Editor [{name}]
pt: Editor de Linha [{name}]

source: (:h for help)
pt: (:h para ajuda)

source: Error in menu node '{nodename}'.
de: Fehler im Menüknoten '{nodename}'.
fr: Une erreur s'est produite dans le choix '{nodename}'.
pt: Erro no menu node '{nodename}'.

source: No description.
de: Keine Beschreibung.
fr: Description non renseignée.
pt: Nenhuma descrição.

source: Commands: <menu option>, help, quit
de: Befehle: <menu option>, help, quit
fr: Utilisez une des commandes : <menu option>, help, quit
pt: Comandos: <menu option>, help (ajuda), quit (sair)

source: Commands: <menu option>, help
de: Befehle: <menu option>, help
fr: Utilisez une des commandes : <menu option>, help
pt: Comandos: <menu option>, help (ajuda)

source: Commands: help, quit
de: Befehle: help, quit
fr: Utilisez une des commandes : help, quit
pt: Comandos: help (ajuda), quit (sair)

source: Commands: help
de: Befehle: help
fr: Utilisez la commande : help
pt: Comandos: help (ajuda)

source: Choose an option or try 'help'.
de: Wähle eine Option oder versuche 'help‘.
fr: Choisissez une option ou entrez la commande 'help'.
pt: Escolha uma opção ou tente 'help' (ajuda).

source: |rInvalid choice.|n
de: |rUngültige Wahl.|n
pt: |rEscolha inválida.|n

source: |Wcurrent|n
de: |Waktuell|n
pt: |Wactual|n

source: |wp|Wrevious page|n
de: |wp|Wrevious (vorherige) Seite|n
pt: |wp|Wágina anterior|n

source: |wn|Wext page|n
de: |wn|Wächste Seite|n
pt: |Wpróxima pági|wn|Wa|n

source: Aborted.
de: Abgebrochen.
pt: Abortado.

source: |rError in ask_yes_no. Choice not confirmed (report to admin)|n
de: |rFehler in ask_yes_no. Auswahl nicht bestätigt (bitte an Administrator melden)|n
pt: |rErro em ask_yes_no. Escola não confirmada (reporte a um admin)|n

source: |xExited pager.|n
de: |xPager verlassen.|n
pt: |xPager encerrado.|n

source: Option not found!
de: Option nicht gefunden!
pt: Opção não encontrada!

source: Option field blank!
de: Option-Feld leer!
pt: Campo de opção em branco!

source: Please be more specific.
de: Bitte sei spezifischer.
pt: Por favor seja mais específico.

source: {obj}.{handlername} is a handler and can't be set directly. To add values, use `{obj}.{handlername}.add()` instead.
de: {obj}.{handlername} ist ein 'handler' und kann nicht direkt gesetzt werden. Um Werte hinzuzufügen, verwende stattdessen `{obj}.{handlername}.add()`.
pt: {obj}.{handlername} é um handler e não pode ser definido directamente. Para adicionar valores, use `{obj}.{handlername}.add()`.

source: {obj}.{handlername} is a handler and can't be deleted directly. To remove values, use `{obj}.{handlername}.remove()` instead.
de: {obj}.{handlername} ist ein 'handler' und kann nicht direkt gelöscht werden. Um Werte zu entfernen, verwenden Sie stattdessen `{obj}.{handlername}.remove()`.
pt: {obj}.{handlername} é um handler e não pode ser apagado directamente. Para remover valores, use `{obj}.{handlername}.remove()`.

source: Input could not be converted to text ({err})
pt: Input não pode ser convertido para texto ({err})

source: Nothing entered for a {option_key}!
pt: Nada foi indicado para {option_key}!

source: '{entry}' is not a valid {option_key}.
pt: '{entry}' não é uma {option_key} válida.

source: No {option_key} entered!
pt: Nenhuma {option_key} indicada!

source: Timezone string '{acct_tz}' is not a valid timezone ({err})
pt: '{acct_tz}' não é uma string de timezone válida ({err})

source: {option_key} must be entered in a 24-hour format such as: {timeformat}
pt: {option_key} tem de estar num formado de 24 horas como: {timeformat}

source: Could not convert section '{interval}' to a {option_key}.
pt: Não foi possíel converter a secção '{interval}' numa {option_key}.

source: That {option_key} is in the past! Must give a Future datetime!
pt: Essa {option_key} está no passado! Tem de indicar uma datetime Futura!

source: Must enter a whole number for {option_key}!
pt: Tem de indicar um número inteiro para {option_key}!

source: Could not convert '{entry}' to a whole number for {option_key}!
pt: Não foi possível converter '{entry}' num número inteiro para {option_key}!

source: Must enter a whole number greater than 0 for {option_key}!
pt: Deve inserir um número inteiro maior que 0 para {option_key}!

source: {option_key} must be a whole number greater than or equal to 0!
pt: {option_key} deve ser um número inteiro maior ou igual a 0!

source: Must enter a true/false input for {option_key}. Accepts {alternatives}.
pt: Deve inserir um input true/false para {option_key}. Aceita {alternatives}.

source: That matched: {matches}. Please be more specific!
pt: Correspondeu: {matches}. Por favor seja mais específico!

source: Could not find timezone '{entry}' for {option_key}!
pt: Não foi possíevl encontrar a timezone '{entry}' para {option_key}!

source: Email address field empty!
pt: Campo para endereço de email vazio!

source: That isn't a valid {option_key}!
pt: Essa não é uma {option_key} válida!

source: No {option_key} entered to set!
pt: Não houve uma {option_key} introduzida!

source: Must enter an access type!
pt: Deve introduzir um tipo de accesso!

source: Access type must be one of: {alternatives}
pt: O tipo de acesso deve ser um destes: {alternatives}

source: Lock func not entered.
pt: Função de lock não introduzida.

source: Add
de: Hinzufügen
pt: Adicionar

source: View
de: Anschauen
pt: Ver

source: Change
de: Ändern
pt: Alterar

source: You don’t have permission to view or edit anything.
de: Du hast nicht die Berechtigung etwas anzuschauen oder zu ändern.
pt: Não tem permissão para ver ou editar nada.

source: You are already puppeting this object.
de: Du steuerst dieses Objekt bereits.

source: You don't have permission to puppet '{key}'.
de: Du hast nicht die Berechtigung '{key}' zu steuern.

source: Sharing |c{name}|n with another of your sessions.
de: Teile |c{name}|n mit einer deiner anderen Sitzungen.

source: |c{name}|n|G is now shared from another of your sessions.|n
de: |c{name}|n|G wird nun von einer deiner anderen Sitzungen gesteuert.|n

source: Taking over |c{name}|n from another of your sessions.
de: Übernehme |c{name}|n von einer deiner anderen Sitzungen.

source: |c{name}|n|R is now acted from another of your sessions.|n
de: |c{name}|n|R wird nun von einer deiner anderen Sitzungen gesteuert.|n

source: You cannot control any more puppets (max {max_puppets})
de: Du kannst nicht noch mehr 'Puppen' steuern (max {max_puppets})

source: Account being deleted.
de: Account wird gelöscht.

source: The Character does not exist.
de: Der Charakter existiert nicht.

source: Command '{command}' is not available.
de: Der Befehl '{command}' ist nicht verfügbar.
fr: La commande '{command}' n'est pas disponible.

source: Maybe you meant {command}?
de: Meintest du vielleicht {command}?

source: Error loading cmdset: No cmdset class '{classname}' in '{path}'. (Traceback was logged {timestamp})
de: Fehler beim Laden von cmdset: Keine cmdset Klasse '{classname}' in '{path}'. (Traceback wurde protokolliert {timestamp})

source: {traceback} SyntaxError encountered when loading cmdset '{path}'. (Traceback was logged {timestamp})
de: {traceback} Syntaxfehler beim laden von cmdset '{path}'. (Traceback wurde protokolliert {timestamp})

source: {traceback} Compile/Run error when loading cmdset '{path}'. (Traceback was logged {timestamp})
de: {traceback} Kompilierungs-/Laufzeitfehler beim laden von cmdset '{path}'. (Traceback wurde protokolliert {timestamp})

source: (Unsuccessfully tried '{path}').
de: (Pfad '{path}' nicht gefunden.)

source: Lock: lock-function '{lockfunc}' is not available.
de: Sperre: Sperrfunktion '{lockfunc}' ist nicht verfügbar.

source: Lock: definition '{lock_string}' has syntax errors.
de: Sperre: Definition '{lock_string}' hat Syntaxfehler.

source: LockHandler on {obj}: access type '{access_type}' changed from '{source}' to '{goal}'
de: LockHandler in {obj}: Zugriffstyp '{access_type}' wechselte von '{source}' zu '{goal}'

source: Lock: '{lockdef}' contains no colon (:).
de: Sperre: '{lockdef}' enthält keinen Doppelpunkt (:).

source: Lock: '{lockdef}' has no access_type (left-side of colon is empty).
de: Sperre: '{lockdef}' hat keinen access_type (die linke Seite vom Doppelpunkt ist leer).

source: Lock: '{lockdef}' has mismatched parentheses.
de: Sperre: '{lockdef}' hat nicht übereinstimmende Klammern.

source: Lock: '{lockdef}' has no valid lock functions.
de: Sperre: '{lockdef}' hat keine gültigen Sperrfunktionen.

source: You see nothing special.
de: Du siehst nichts Besonderes.

source: Couldn't perform move ({err}). Contact an admin.
de: Bewegung konnte nicht ausgeführt werden ({err}). Kontaktiere einen Administrator.

source: Could not find default home '(#{dbid})'.
de: Standard-Zuhause konnte nicht gefunden werden '(#{dbid})'.

source: Your character {key} has been destroyed.
de: Dein Charakter {key} wurde entfernt.

source: This is a character.
de: Dies ist ein Charakter.

source: {name} has left the game{reason}.
de: {name} hat das Spiel verlassen{reason}.

source: This is a room.
de: Dies ist ein Raum.

source: This is an exit.
de: Dies ist ein Ausgang.

source: Found {num} matching prototypes.
de: {num} passende Prototypen gefunden.

source: '{key}' ({next_repeat}/{interval}, {repeats} repeats): {desc}
de: '{key}' ({next_repeat}/{interval}, {repeats} Wiederholungen): {desc}

source: Script {key}(#{dbid}) of type '{name}': at_repeat() error '{err}'.
de: Script {key}(#{dbid}) vom Typ '{name}': at_repeat() Fehler '{err}'.

source: Welcome to your new |wEvennia|n-based game! Visit https://www.evennia.com if you need help, want to contribute, report issues or just join the community. As a privileged user, write |wbatchcommand tutorial_world.build|n to build tutorial content. Once built, try |wintro|n for starting help and |wtutorial|n to play the demo game.
de: Willkommen bei deinem neuen Spiel auf |wEvennia|n-Basis! Besuche http://www.evennia.com, wenn du Hilfe brauchst, etwas beitragen, Probleme melden oder einfach der Community beitreten willst. Als privilegierter Benutzer kannst du '|wbatchcommand tutorial_world.build|n'eingeben, um Tutorial-Inhalte zu erstellen. Sobald erstellt, probiere |wintro|n

source: Limbo
de: Limbus
fr: Limbes

source: (connection lost)
de: (Verbindung verloren)

source: idle timeout exceeded
de: Idle-Timeout überschritten

source: Menu node '{nodename}' is either not implemented or caused an error. Make another choice or try 'q' to abort.
de: Der Menüknoten '{nodename}' ist entweder nicht implementiert oder hat einen Fehler verursacht. Triff eine andere Wahl oder wähle 'q', um abzubrechen.

source: Multiple matches:
de: Es gab mehrere Treffer:

source: Could not find '{query}'.
de: Kann '{query}' nicht finden.

source: More than one match for '{query}' (please narrow target):
de: Mehr als ein Treffer für ‚{query}‘ (Bitte das Ziel präzisieren):

source: Maybe you meant %s?
fr: Vouliez-vous dire %s ?

source: <Merged {mergelist} {mergetype}, prio {prio}>: {current}
fr: <Fusionné {mergelist} {mergetype}, prio {prio}>: {current}

source: Say what?
fr: Que voulez-vous dire ?

source: Channel '%s' not found.
fr: Le canal '%s' ne semble pas exister.

source: You are not connected to channel '%s'.
fr: Vous n'êtes pas connecté au canal '%s'.

source: You are not permitted to send to channel '%s'.
fr: Vous n'avez pas le droit de parler sur le canal '%s'.

source: (channel)
fr: (canal)

source: Lock: lock-function '%s' is not available.
fr: Verrou : lock-function '%s' n'est pas disponible.

source: Lock: definition '%s' has syntax errors.
fr: Verrou : la définition '%s' a des erreurs de syntaxe.

source: LockHandler on %(obj)s: access type '%(access_type)s' changed from '%(source)s' to '%(goal)s'
fr: Gestionnaire de verrous sur %(obj)s: type d'accès '%(access_type)s' a changé de '%(source)s' à '%(goal)s'

source: Couldn't perform move ('%s'). Contact an admin.
fr: Impossible de se déplacer vers ('%s'). Veuillez contacter un administrateur.

source: Could not find default home '(#%d)'.
fr: Impossible de trouver la salle de départ (default home) par défaut : '#%d'.

source: Your character %s has been destroyed.
fr: Votre personnage %s a été détruit.

source: '%(key)s' (%(next_repeat)s/%(interval)s, %(repeats)s repeats): %(desc)s
fr: '%(key)s' (%(next_repeat)s/%(interval)s, %(repeats)s répète) : %(desc)s

source: Script %(key)s(#%(dbid)s) of type '%(cname)s': at_repeat() error '%(err)s'.
fr: Le script %(key)s(#%(dbid)s) de type '%(cname)s' a rencontré une erreur durant at_repeat() : '%(err)s'.

source: %s From a terminal client, you can also use a phrase of multiple words if you enclose the password in double quotes.
fr: %s Depuis votre client, vous pouvez également préciser une phrase contenant plusieurs mots séparés par un espace, dès lors que cette phrase est entourée de guillemets.

source: Menu node '{nodename}' is either not implemented or caused an error. Make another choice.
fr: Ce choix '{nodename}' n'est pas implémenté, ou bien a créé une erreur. Faies un autre choix.

source: Could not find '%s'.
fr: Impossible de trouver '%s'.

source: More than one match for '%s' (please narrow target):
fr: Plus d'une possibilité pour '%s' (veuillez préciser) :
